# import re

# email =input("Whats name ?").strip()
# if re.search(r"^\w+@(\w+\.)?\w+\.edu$", email):
#     print("valid")


# name = input("whats your name ? ").strip()
# matches = re.search(r"^(.+), (.+)$, name)

# if matches:
#     last = matches.group(1)
#     first = matches.group(2)
#     name = matches.group(2) + " " + matches.group(1)

# print(f"hello, {name}")

# url = input("URL: ").strip()

# if matches := re.search(r"^https?://(?:www\.)?twitter\.com/(.+)$", url, re.IGNORECASE):
#     print("Username: ", matches.group(1))


"""
? = واتە سفر یان یەک پیت
. = واتە هەر پیتێک بێت
+ = واتە یەک پیت بێت یان زیاتر
* = واتە سفر یان یەک پیت زیاتر
^ = واتە دەبێت بەوە دەستپێبکات
$ = واتە دەبێت بەوە کۆتایی بێت
[] = واتە ئەم پیتانەی ئەتەوێت هەبێت لەم کەوانە دای دەنێیت
[^] = واتە ئەو هەموو پیتێک ڕێپێدراوە جگە لەوەی ناو ئەم کەوانەیەیە.
[a-zA-Z0-9_] = واتە ئەمانە ڕێگەپێدراون بۆ ژمارە و پیت دەتوانی بەس سەرەتا و کۆتایی بنووسی
\w = واتە هەموو پیتەکان و ژمارەکان  ڕێگەپێدراوە و لەگەڵ _
\d = واتە بەس ژمارە
\D = واتە بەس ژمارە نەبێت
\s = واتە بۆشایی ئەبێت
\S = واتە بۆشایی رێگە پێنەدراوە
\W = واتە پیتەکان نەبێت.
(A | B) = واتە هەر پیتێک بێت لە بەینی ئەوانە ئەی و بی یان شتێکی تر کە لە ناو کەوانەکە هەبێت
(....) =  بەمە دەتوانی گروپێک لەو ریگولەر ئیکسپرێشنانە بکەیتە کەوانەیەک بڵێ ئەمانە قبوڵن
(....)? = ئەمە واتە ئەوانەی لەناو ئەم کەوانەیەن ئەدتوانن هەبن یان نا


"""
